<?php

use Mpdf\Mpdf;
use Mpdf\MpdfException;

require_once __DIR__ . '../../bootstrap.php';

$mpdf = new Mpdf();

try {
    $mpdf->WriteHTML('<h1>КЫРГЫЗСКО-ТУРЕЦКИЙ УНИВЕРСИТЕТ МАНАС</h1>');
    $mpdf->WriteHTML('<i>Привет как твои дела</i>');
    $mpdf->WriteHTML('<b>Тут текст жирный</b>');
    $mpdf->WriteHTML('<u>Бул тексттин астында сызык бар (с подчеркиванием)</u>');
    $mpdf->WriteHTML('<p>Орусияда Алтай менен Хакасия республикаларынын бийликтери калкты милдеттүү түрдө эмдөө чечимин кабыл алышты.'.
        'Президенттин сапарынын натыйжасында, Бишкек менен Ашхабаддын ортосундагы карым-катыш ар кайсыл багыттарда күчтөнүшү мүмкүн.'.
        'Бирок сүйлөшүүлөрдүн өзөгүн коопсуздук, Ооганстандагы жагдай жана суу маселеси түзөт деп боолгоп турам. Суу демекчи, экономикалык ресурсту башкаруу'.
        'деген түшүнүк бар эмеспи. Борбор Азия чөлкөмүндөгү мамлекеттердин айрымдары суунун башында, кээ бирлери ылдый жагында жайгашкан.'.
        'Суу дипломатиясы жаатында Түркмөнстандын ролу маанилүү. Алар Ооганстанга кетчү сууну көзөмөлдөйт. Ушул маселеде Кыргызстан так позиция менен сүйлөшүүгө тийиш.</p>');


//    $ad_r = "Үсөн";
//    $soyad_r = "Батырбеков";
//    $babaad_r = "Интерполович";
//    $dtarih =  "2020-20-20";
//    $fakulte =  "Факультет";
//    $bolum =  "Инженерия";
//    $numara_m = 232323;
//
//    $mpdf->SetXY(15,15);
//    $mpdf->SetX(60);
//
//
//    $mpdf->Cell(15,5,'КЫРГЫЗСКО - ТУРЕЦКИЙ УНИВЕРСИТЕТ МАНАС',0,0,'C');
//
//    $mpdf->SetXY(15,25);
//    $mpdf->SetX(60);
//    $mpdf->Cell(11,0,'СТУДЕНЧЕСКИЙ ОТДЕЛ',0,0,'C');
//
//    $mpdf->SetXY(15,40);
//    $mpdf->SetX(15);
//    $mpdf->Cell(13,0,'Номер   :',0,0,'L');
//    $mpdf->SetX(85);
//    $mpdf->Cell(13,0,'Дата : ',0,0,'L');
//    $mpdf->SetX(100);
//    $mpdf->Cell(13,0,date("d.m.Y"),0,0,'L');
//
//    $mpdf->SetXY(15,47);
//    $mpdf->SetX(15);
//    $mpdf->Cell(15,0,'Тема   : ',0,0,'L');
//
//
//    $mpdf->SetXY(15,72);
//    $mpdf->SetX(15);
//    $mpdf->Cell(15,0,'Имя',0,0,'L');
//    $mpdf->SetX(45);
//    $mpdf->Cell(15,0,':',0,0,'L');
//    $mpdf->SetX(50);
//    $mpdf->Cell(15,0,$ad_r,0,0,'L');
//
//    $mpdf->SetXY(15,79);
//    $mpdf->SetX(15);
//    $mpdf->Cell(15,0,'Фамилия',0,0,'L');
//    $mpdf->SetX(45);
//    $mpdf->Cell(15,0,':',0,0,'L');
//    $mpdf->SetX(50);
//    $mpdf->Cell(15,0,$soyad_r,0,0,'L');
//
//    $mpdf->SetXY(15,86);
//    $mpdf->SetX(15);
//    $mpdf->Cell(15,0,'Отчество',0,0,'L');
//    $mpdf->SetX(45);
//    $mpdf->Cell(15,0,':',0,0,'L');
//    $mpdf->SetX(50);
//    $mpdf->Cell(15,0,$babaad_r,0,0,'L');
//
//    $mpdf->SetXY(15,93);
//    $mpdf->SetX(15);
//    $mpdf->Cell(15,0,'Дата рождения',0,0,'L');
//    $mpdf->SetX(45);
//    $mpdf->Cell(15,0,':',0,0,'L');
//    $mpdf->SetX(50);
//    $mpdf->Cell(15,0,$dtarih,0,0,'L');
//
//    $mpdf->SetXY(15,100);
//    $mpdf->SetX(15);
//    $mpdf->Cell(15,0,'Факультет',0,0,'L');
//    $mpdf->SetX(45);
//    $mpdf->Cell(15,0,':',0,0,'L');
//    $mpdf->SetX(50);
//    $mpdf->Cell(15,0,$fakulte,0,0,'L');
//
//    $mpdf->SetXY(15,107);
//    $mpdf->SetX(15);
//    $mpdf->Cell(15,0,'Направление',0,0,'L');
//    $mpdf->SetX(45);
//    $mpdf->Cell(15,0,':',0,0,'L');
//    $mpdf->SetX(50);
//    $mpdf->Cell(15,0,$bolum,0,0,'L');
//
//    $mpdf->SetXY(15,114);
//    $mpdf->SetX(15);
//    $mpdf->Cell(15,0,'Студент №',0,0,'L');
//    $mpdf->SetX(45);
//    $mpdf->Cell(15,0,':',0,0,'L');
//    $mpdf->SetX(50);
//    $mpdf->Cell(15,0,$numara_m,0,0,'L');

    $mpdf->Output('sample.pdf', 'F');

} catch (MpdfException $e) {

    print_r($e);

}







